---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.#ctor
source: html/2455b294-c99b-f041-5120-0dd665d04e11.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.#ctor Method

Constructs a new ExternalServiceOptions with default settings.

## Syntax (C#)
```csharp
public ExternalServiceOptions()
```